      /if not defined(COPYRIGHT_DSPEC)
     HCopyright('v2.2.1 - 14.06.2017 - +
     H           Copyright (c) 2013-2017 iRPGUnit Project Team')
      /eof
      /endif
     D cRPGUNIT_VERSION...
     D                 C                   '2.2.1'
     D cRPGUNIT_DATE...
     D                 C                   '14.06.2017'

