      /if not defined(COPYRIGHT_DSPEC)
     HCopyright('v2.4.3 - 20.02.2019 - +
     H           Copyright (c) 2013-2019 iRPGUnit Project Team')
      /eof
      /endif
     D cRPGUNIT_VERSION...
     D                 C                   '2.4.3'
     D cRPGUNIT_DATE...
     D                 C                   '20.02.2019'

