      /if not defined(COPYRIGHT_DSPEC)
     HCopyright('v2.2.3 - 25.06.2018 - +
     H           Copyright (c) 2013-2018 iRPGUnit Project Team')
      /eof
      /endif
     D cRPGUNIT_VERSION...
     D                 C                   '2.2.3'
     D cRPGUNIT_DATE...
     D                 C                   '25.06.2018'

