      /if not defined(COPYRIGHT_DSPEC)
     HCopyright('v2.3.0 - 21.09.2018 - +
     H           Copyright (c) 2013-2018 iRPGUnit Project Team')
      /eof
      /endif
     D cRPGUNIT_VERSION...
     D                 C                   '2.3.0'
     D cRPGUNIT_DATE...
     D                 C                   '21.09.2018'

