             PGM        PARM(&CURLIB &USRLIBL)

             DCL        VAR(&CURLIB ) TYPE(*CHAR) LEN(  10)
             DCL        VAR(&USRLIBL) TYPE(*CHAR) LEN(2750)

             RTVJOBA    CURLIB(&CURLIB) USRLIBL(&USRLIBL)

             IF         COND(&CURLIB *EQ '*NONE') THEN(DO)
                CHGVAR     VAR(&CURLIB) VALUE('*CRTDFT')
             ENDDO

             ENDPGM
