      //
      // Prototype for QGYCLST API.
      //
      // Close List
      //
      // http://publib.boulder.ibm.com/iseries/v5r2/ic2924/info/apis/qgyclst.htm
      //

     D QGYCLST         pr                  ExtPgm('QGYCLST')
     D  i_rqsHdl                      4a   const
     D  io_error                  32766a         options(*varsize)
