
      //  Change Object Description (QLICOBJD) API
     D QLICOBJD...
     D                 PR                  extpgm('QLICOBJD')
     D   rtnLib                      10A
     D   qObj                        20A   const
     D   type                        10A   const
     D   chgObjInf                32767A   const options(*varsize)
     D   errCode                  32767A   const options(*varsize)
