**FREE

//
// Close Spooled File API
//

dcl-pr qspclosp extpgm('QSPCLOSP');
  splfHdl         int(10);
  error           char(32766) options(*varsize) noopt;
end-pr;

