      //
      // Prototypes for USRSPC.
      //

       // Creates a User Space. Returns a pointer to it.
     D crtUsrSpc       pr              *   extproc('crtUsrSpc')
        // qualified user space name.
     D  usrSpc                             const likeds(Object_t)
        // User space text description.
     D  text                         50a   const


