      /if not defined(COPYRIGHT_DSPEC)
     HCopyright('v2.2.2 - 09.05.2018 - +
     H           Copyright (c) 2013-2018 iRPGUnit Project Team')
      /eof
      /endif
     D cRPGUNIT_VERSION...
     D                 C                   '2.2.2'
     D cRPGUNIT_DATE...
     D                 C                   '09.05.2018'

