
     h NoMain Option(*SrcStmt: *NoDebugIo)

     DtestEmpty        pr

     PtestEmpty        b                   export
     DtestEmpty        pi
      /free
      /end-free
     PtestEmpty        e

