
     H NoMain Option(*SrcStmt: *NoDebugIo)

      /include qsrc,TESTCASE

     Dnot_a_test       pr

     Pnot_a_test       b                   export
     Dnot_a_test       pi
     Pnot_a_test       e

