 
     H NoMain Option(*SrcStmt)
 
      /copy RPGUNIT1,TESTCASE
 
     Dnot_a_test       pr
 
     Pnot_a_test       b                   export
     Dnot_a_test       pi
     Pnot_a_test       e
 
