**free
/if not defined (IRPGUNIT_ASSERTV2)
/define IRPGUNIT_ASSERTV2

  // Dummy member for 7.3 and 7.4 without PTFs.
  // Will be copied to ASSERTV2 before installation on systems with 7.3 and 7.4.

/endif

