      /if not defined(COPYRIGHT_DSPEC)
     HCopyright('v3.0.0 - xx.xx.xxxx - +
     H           Copyright (c) 2013-xxxx iRPGUnit Project Team')
      /eof
      /endif
     D cRPGUNIT_VERSION...
     D                 C                   '3.0.0'
     D cRPGUNIT_DATE...
     D                 C                   'xx.xx.xxxx'

