      /if not defined(COPYRIGHT_DSPEC)
     HCopyright('v3.0.0 - 20.04.2019 - +
     H           Copyright (c) 2013-2019 iRPGUnit Project Team')
      /eof
      /endif
     D cRPGUNIT_VERSION...
     D                 C                   '3.0.0'
     D cRPGUNIT_DATE...
     D                 C                   '20.04.2019'

