       //----------------------------------------------------------------------
       //   Procedure Prototypes
       //----------------------------------------------------------------------

     D getVersion...
     D                 pr
     D                                     extproc('getVersion')
     D  version                      20a
     D  date                         10a
