
      /copy RPGUNITY1,TEMPLATES

     D RUTAGTST        PR                  extpgm('RUTAGTST')
     D   object                      10A   const
     D   library                     10A   const
     D   srcFile                           const likeds(Object_t)
     D   srcMbr                      10A   const

