      /if not defined(COPYRIGHT_DSPEC)
     HCopyright('v2.4.2 - 02.11.2018 - +
     H           Copyright (c) 2013-2018 iRPGUnit Project Team')
      /eof
      /endif
     D cRPGUNIT_VERSION...
     D                 C                   '2.4.2'
     D cRPGUNIT_DATE...
     D                 C                   '02.11.2018'

