      /if not defined(LLIST_SORT)
      /define LLIST_SORT

      *------------------------------------------------------------------------
      * Prototypes
      *------------------------------------------------------------------------
     D list_sort_insertionSort...
     D                 PR                  extproc('list_sort_insertionSort')
     D   listPtr                       *   const

      /endif
