      //
      // Prototype for QGYCLST API.
      //
      // Close List
      //
      // http://publib.boulder.ibm.com/iseries/v5r2/ic2924/info/apis/qgyclst.htm
      //

     DQGYCLST          pr                  ExtPgm('QGYCLST')
     D rqsHdl                         4a   const
     D error                      32766a   options(*varsize: *omit) noopt
