       //----------------------------------------------------------------------
       // Setup Utility Procedures Definitions.
       //----------------------------------------------------------------------

     H NoMain
      /copy RPGUNITY1,H_SPEC


       //----------------------------------------------------------------------
       //   IMPORTS
       //----------------------------------------------------------------------

      /copy RPGUNITY1,QCMDEXC
      /copy RPGUNIT1,TESTCASE


       //----------------------------------------------------------------------
       //   CONSTANTS
       //----------------------------------------------------------------------

       //----------------------------------------------------------------------
       //   GLOBAL VARIABLES
       //----------------------------------------------------------------------

       //----------------------------------------------------------------------
       //   PROCEDURES
       //----------------------------------------------------------------------

       //--------------------------------------------------------------------
       //        Clear File
       //--------------------------------------------------------------------
     P clrpfm...
     P                 b                   export
     D                 pi
     D  w1fileNm                     10a   const
     D  w1mbrNm                      10a   const options(*NoPass)

     D w1cmd           s          32702a   varying

      /free

        if %parms = 1;
          runCmd( 'CLRPFM FILE(*CURLIB/' + %trim(w1fileNm) + ')' );
        else;
          runCmd( 'CLRPFM FILE(*CURLIB/' + %trim(w1fileNm) + ')'
                + ' MBR(' + %trim(w1mbrNm) + ')' );
        endif;

      /end-free
     P                 e


       //--------------------------------------------------------------------
       //        Reclaim Activation Group
       //--------------------------------------------------------------------
     P rclactgrp...
     P                 b                   export
     D                 pi
     D  w1actGrpNm                   10a   const

     D w1cmd           s          32702a   varying

      /free

        runCmd( 'RCLACTGRP ' + %trim(w1actGrpNm) );

      /end-free
     P                 e


       //--------------------------------------------------------------------
       //        Run Command
       //--------------------------------------------------------------------
     P runCmd...
     P                 b                   export
     D                 pi
     D  w1cmd                     32702a   const varying
      /free

        qcmdexc( w1cmd : %len(w1cmd) );

      /end-free
     P                 e

